CSI API ETABS v1
cCaseStaticNonlinear.GetLoads Method
 Retrieves the load data for the specified load case
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoads(
	string Name,
	ref int NumberLoads,
	ref string[] LoadType,
	ref string[] LoadName,
	ref double[] SF
)
Function GetLoads (
	Name As String,
	ByRef NumberLoads As Integer,
	ByRef LoadType As String(),
	ByRef LoadName As String(),
	ByRef SF As Double()
) As Integer
Dim instance As cCaseStaticNonlinear
Dim Name As String
Dim NumberLoads As Integer
Dim LoadType As String()
Dim LoadName As String()
Dim SF As Double()
Dim returnValue As Integer
returnValue = instance.GetLoads(Name,
	NumberLoads, LoadType, LoadName,
	SF)
int GetLoads(
	String^ Name,
	int% NumberLoads,
	array<String^>^% LoadType,
	array<String^>^% LoadName,
	array<double>^% SF
)
abstract GetLoads :
        Name : string *
        NumberLoads : int byref *
        LoadType : string[] byref *
        LoadName : string[] byref *
        SF : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing static nonlinear load case.
NumberLoads
Type: System.Int32
 The number of loads assigned to the specified analysis case.
LoadType
Type: System.String[]
 This is an array that includes either Load or Accel, indicating the type of each load assigned to the load case.
LoadName
Type: System.String[]
 This is an array that includes the name of each load assigned to the load case.
 If the LoadType item is Load, this item is the name of a defined load pattern.
 If the LoadType item is Accel, this item is UX, UY, UZ, RX, RY or RZ, indicating the direction of the load.
SF
Type: System.Double[]
 This is an array that includes the scale factor of each load assigned to the load case. [L/s^2] for Accel UX UY and UZ; otherwise unitless
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim MyLoadType() As String
   Dim MyLoadName() As String
   Dim MySF() As Double
   Dim NumberLoads As Integer
   Dim LoadType() As String
   Dim LoadName() As String
   Dim SF() As Double
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
    ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'add static nonlinear load case
    ret = SapModel.LoadCases.StaticNonlinear.SetCase("LCASE1")
'set load data
    ReDim MyLoadType(1)
    ReDim MyLoadName(1)
    ReDim MySF(1)
    MyLoadType(0) = "Load"
    MyLoadName(0) = "DEAD"
    MySF(0) = 0.7
    MyLoadType(1) = "Accel"
    MyLoadName(1) = "UZ"
    MySF(1) = 1.2
    ret = SapModel.LoadCases.StaticNonlinear.SetLoads("LCASE1", 2, MyLoadType, MyLoadName, MySF)
'get load data
    ret = SapModel.LoadCases.StaticNonlinear.GetLoads("LCASE1", NumberLoads, LoadType, LoadName, SF)
'refresh view
   ret = SapModel.View.RefreshView(0, False)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cCaseStaticNonlinear Interface
ETABSv1 Namespace